[
  {
    "slug": "best-time-to-visit-agadir",
    "status": "published",
    "coverImage": "https://images.pexels.com/photos/1540406/pexels-photo-1540406.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
    "translations": {
      "en": {
        "title": "When is the Best Time to Visit Agadir? A Seasonal Guide",
        "content": "## Endless Sun in Morocco's Premier Resort\n\nAgadir is a year-round destination, but the best time to visit depends on what you're looking for. For perfect beach weather, the summer months from **June to August** are ideal, with long, sunny days and warm ocean temperatures. However, for those looking to explore the city and surrounding regions without the intense heat, the shoulder seasons of spring (March to May) and autumn (September to November) offer pleasant temperatures and fewer crowds."
      },
      "fr": {
        "title": "Quelle est la Meilleure Période pour Visiter Agadir ? Un Guide Saisonnier",
        "content": "## Soleil Sans Fin dans la Première Station Balnéaire du Maroc\n\nAgadir est une destination agréable toute l'année, mais le meilleur moment pour la visiter dépend de ce que vous recherchez. Pour un temps de plage parfait, les mois d'été de **juin à août** sont idéaux, avec de longues journées ensoleillées et des températures océaniques chaudes. Cependant, pour ceux qui souhaitent explorer la ville et les régions environnantes sans la chaleur intense, les saisons intermédiaires du printemps (mars à mai) et de l'automne (septembre à novembre) offrent des températures plaisantes et moins de foule."
      }
    }
  },
  {
    "slug": "tiznit-silver-city",
    "status": "published",
    "coverImage": "https://images.pexels.com/photos/8196556/pexels-photo-8196556.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
    "translations": {
      "en": {
        "title": "Tiznit: The Silver City's Artisanal Heritage",
        "content": "### A Legacy of Craftsmanship\n\nJust a short drive from Agadir lies Tiznit, a city renowned for its silver craftsmanship. For centuries, local artisans have been creating intricate Berber jewelry, known for its distinctive designs and filigree work. A walk through the old medina reveals a living history, where the sound of hammers striking silver can still be heard in the small workshops that line the alleyways. It's a must-visit for anyone interested in authentic Moroccan culture."
      },
      "fr": {
        "title": "Tiznit : L'Héritage Artisanal de la Cité d'Argent",
        "content": "### Un Héritage d'Artisanat\n\nÀ une courte distance en voiture d'Agadir se trouve Tiznit, une ville réputée pour son artisanat de l'argent. Depuis des siècles, les artisans locaux créent des bijoux berbères complexes, connus pour leurs motifs distinctifs et leur travail en filigrane. Une promenade dans l'ancienne médina révèle une histoire vivante, où le son des marteaux frappant l'argent peut encore être entendu dans les petits ateliers qui bordent les ruelles. C'est une visite incontournable pour quiconque s'intéresse à la culture marocaine authentique."
      }
    }
  },
  {
    "slug": "secrets-of-moroccan-mint-tea",
    "status": "draft",
    "coverImage": "https://images.pexels.com/photos/4109944/pexels-photo-4109944.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
    "translations": {
      "en": {
        "title": "The Art and Secrets of Moroccan Mint Tea",
        "content": "## More Than Just a Drink\n\nIn Morocco, mint tea is not just a beverage; it's a symbol of hospitality, friendship, and tradition. Known as 'Berber whiskey', it is served at all times of the day and for any occasion. The preparation itself is a ceremony, involving green tea, fresh mint leaves, and a generous amount of sugar, all skillfully poured from a height to create a delicate foam known as the 'crown'."
      },
      "fr": {
        "title": "L'Art et les Secrets du Thé à la Menthe Marocain",
        "content": "## Plus qu'une Simple Boisson\n\nAu Maroc, le thé à la menthe n'est pas seulement une boisson ; c'est un symbole d'hospitalité, d'amitié et de tradition. Surnommé le 'whisky berbère', il est servi à toute heure de la journée et pour toute occasion. La préparation elle-même est une cérémonie, impliquant du thé vert, des feuilles de menthe fraîche et une généreuse quantité de sucre, le tout habilement versé de haut pour créer une mousse délicate appelée la 'couronne'."
      }
    }
  },
  {
    "slug": "exploring-paradise-valley",
    "status": "published",
    "coverImage": "https://images.pexels.com/photos/158734/paradise-valley-arizona-rocks-nature-158734.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
    "translations": {
      "en": {
        "title": "Finding Paradise: A Guide to Paradise Valley, Agadir",
        "content": "### An Oasis in the Mountains\n\nNestled in the foothills of the High Atlas Mountains lies a true oasis: Paradise Valley. Known for its natural rock pools, stunning waterfalls, and lush palm groves, it's the perfect escape from the city heat. A short hike along the riverbed leads you to a series of turquoise pools perfect for swimming and cliff jumping. It's a day trip that truly lives up to its name."
      },
      "fr": {
        "title": "Trouver le Paradis : Un Guide pour la Vallée du Paradis, Agadir",
        "content": "### Une Oasis dans les Montagnes\n\nNichée dans les contreforts du Haut Atlas se trouve une véritable oasis : la Vallée du Paradis. Connue pour ses piscines naturelles dans la roche, ses superbes cascades et ses palmeraies luxuriantes, c'est l'évasion parfaite de la chaleur de la ville. Une courte randonnée le long du lit de la rivière vous mène à une série de bassins turquoise parfaits pour la baignade et le saut de falaise. C'est une excursion d'une journée qui porte bien son nom."
      }
    }
  }
]
