[
  {
    "price": { "amount": 400, "currency": "MAD", "prefix": "from" },
    "locationId": "essaouira",
    "isFeatured": true,
    "translations": {
      "en": {
        "title": "Essaouira: The Windy City of Art",
        "description": "Explore the charming coastal city of Essaouira. Walk along its historic ramparts, discover the vibrant art scene in the medina, and enjoy the fresh sea breeze at the bustling fishing port.",
        "included": "Transport from Agadir\nLocal Guide\nMint Tea",
        "notIncluded": "Lunch\nGratuities",
        "importantInfo": "**Duration:** Full Day\n**Best for:** Culture, History, Photography",
        "itinerary": "Day 1: Coastal Drive & Medina Exploration\nWe'll pick you up from your hotel and enjoy a scenic drive along the Atlantic coast to Essaouira. Upon arrival, we'll explore the historic medina, a UNESCO World Heritage site, visit the Skala de la Ville ramparts, and browse the local art galleries and wood-carving workshops."
      },
      "fr": {
        "title": "Essaouira : La Cité Venteuse des Arts",
        "description": "Explorez la charmante ville côtière d'Essaouira. Promenez-vous le long de ses remparts historiques, découvrez la scène artistique vibrante de la médina et profitez de la brise marine au port de pêche animé.",
        "included": "Transport depuis Agadir\nGuide Local\nThé à la menthe",
        "notIncluded": "Déjeuner\nPourboires",
        "importantInfo": "**Durée :** Journée complète\n**Idéal pour :** Culture, Histoire, Photographie",
        "itinerary": "Jour 1 : Route côtière et exploration de la médina\nNous viendrons vous chercher à votre hôtel pour un trajet panoramique le long de la côte atlantique jusqu'à Essaouira. À l'arrivée, nous explorerons la médina historique, site classé au patrimoine mondial de l'UNESCO, visiterons les remparts de la Skala de la Ville et parcourrons les galeries d'art locales et les ateliers de sculpture sur bois."
      }
    },
    "coverImage": "https://images.pexels.com/photos/1831313/pexels-photo-1831313.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
    "galleryImages": []
  },
  {
    "price": { "amount": 2500, "currency": "MAD", "prefix": "from" },
    "locationId": "marrakech",
    "isFeatured": true,
    "translations": {
      "en": {
        "title": "Luxury Agafay Desert Sunset & Dinner",
        "description": "An unforgettable evening in the Agafay stone desert. Enjoy a camel ride at sunset followed by a gourmet dinner under the stars in a luxurious desert camp.",
        "included": "Private 4x4 Transfer\nCamel Ride\nGourmet 3-course dinner\nLive traditional music",
        "notIncluded": "Alcoholic beverages\nTips",
        "importantInfo": "**Experience:** Evening\n**Vibe:** Romantic, Luxury",
        "itinerary": "Evening: Desert Journey\nYour private driver will pick you up from your Marrakech hotel in the afternoon for a journey into the Agafay Desert. Upon arrival at our luxury camp, you will embark on a guided camel ride to a high dune to witness a spectacular sunset over the stone desert. After sunset, return to the camp for a gourmet three-course Moroccan dinner, accompanied by live traditional music under the stars."
      },
      "fr": {
        "title": "Coucher de Soleil et Dîner de Luxe dans le Désert d'Agafay",
        "description": "Une soirée inoubliable dans le désert de pierre d'Agafay. Profitez d'une balade à dos de chameau au coucher du soleil, suivie d'un dîner gastronomique sous les étoiles dans un camp de luxe.",
        "included": "Transfert privé en 4x4\nBalade à dos de chameau\nDîner gastronomique 3 services\nMusique traditionnelle en direct",
        "notIncluded": "Boissons alcoolisées\nPourboires",
        "importantInfo": "**Expérience :** Soirée\n**Ambiance :** Romantique, Luxe",
        "itinerary": "Soirée : Voyage dans le désert\nVotre chauffeur privé viendra vous chercher à votre hôtel de Marrakech dans l'après-midi pour un voyage dans le désert d'Agafay. À votre arrivée à notre camp de luxe, vous embarquerez pour une balade guidée à dos de chameau jusqu'à une haute dune pour assister à un coucher de soleil spectaculaire sur le désert de pierre. Après le coucher du soleil, retour au camp pour un dîner marocain gastronomique à trois plats, accompagné de musique traditionnelle en direct sous les étoiles."
      }
    },
    "coverImage": "https://images.pexels.com/photos/13687063/pexels-photo-13687063.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
    "galleryImages": []
  },
  {
    "price": { "amount": 450, "currency": "MAD", "prefix": "from" },
    "locationId": "agadir",
    "isFeatured": true,
    "translations": {
      "en": { 
        "title": "Taghazout Bay Surf Lesson", 
        "description": "Ride the famous waves of Taghazout, a world-renowned surf spot. This two-hour lesson with a professional instructor is perfect for beginners and intermediates alike.",
        "itinerary": "Session Plan: Your lesson begins with a safety briefing and basic techniques on the sand. You will then spend over an hour in the water with your instructor, learning to catch waves and stand up on the board. All equipment (board and wetsuit) is provided."
      },
      "fr": { 
        "title": "Leçon de Surf à la Baie de Taghazout", 
        "description": "Surfez sur les vagues célèbres de Taghazout, un spot de surf de renommée mondiale. Cette leçon de deux heures avec un instructeur professionnel est parfaite pour les débutants et les intermédiaires.",
        "itinerary": "Plan de la session : Votre leçon commence par un briefing sur la sécurité et les techniques de base sur le sable. Vous passerez ensuite plus d'une heure dans l'eau avec votre instructeur, apprenant à attraper les vagues et à vous tenir debout sur la planche. Tout l'équipement (planche et combinaison) est fourni."
      }
    },
    "coverImage": "https://images.pexels.com/photos/1654210/pexels-photo-1654210.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
    "galleryImages": []
  },
  {
    "price": { "amount": 700, "currency": "MAD", "prefix": "from" },
    "locationId": "marrakech",
    "isFeatured": false,
    "translations": {
      "en": { 
        "title": "Day Trip to Ait Benhaddou Kasbah", 
        "description": "Journey to the UNESCO World Heritage site of Ait Benhaddou, a fortified ksar featured in films like Gladiator and Game of Thrones. Explore its ancient alleys and breathtaking views.",
        "itinerary": "Day Trip: We depart Marrakech early, crossing the spectacular Tizi n'Tichka pass in the High Atlas mountains. We will arrive at Ait Benhaddou for a guided tour of the ancient ksar. After lunch at a local restaurant with panoramic views, we will begin our return journey to Marrakech."
      },
      "fr": { 
        "title": "Excursion d'une Journée à la Kasbah d'Ait Benhaddou", 
        "description": "Voyagez vers le site du patrimoine mondial de l'UNESCO d'Ait Benhaddou, un ksar fortifié vu dans des films comme Gladiator et Game of Thrones. Explorez ses ruelles anciennes et ses vues imprenables.",
        "itinerary": "Excursion d'une journée : Nous quittons Marrakech tôt le matin, en traversant le spectaculaire col de Tizi n'Tichka dans les montagnes du Haut Atlas. Nous arriverons à Ait Benhaddou pour une visite guidée de l'ancien ksar. Après le déjeuner dans un restaurant local avec vue panoramique, nous entamerons notre voyage de retour vers Marrakech."
      }
    },
    "coverImage": "https://images.pexels.com/photos/2432221/pexels-photo-2432221.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
    "galleryImages": []
  },
  {
    "price": { "amount": 800, "currency": "MAD", "prefix": "from" },
    "locationId": "taroudant",
    "isFeatured": true,
    "translations": {
      "en": { 
        "title": "Palm Grove Oasis & Kasbah Tour", 
        "description": "Escape to a lush oasis filled with thousands of palm trees. Discover ancient kasbahs hidden within the greenery and learn about the traditional irrigation systems that sustain life here.",
        "itinerary": "Full Day Tour: Your day begins with a visit to the historic city walls of Taroudant. We then venture into a nearby palm grove oasis, where we will take a leisurely walk to explore the traditional 'khettara' irrigation channels and visit a restored kasbah for mint tea."
      },
      "fr": { 
        "title": "Tour de l'Oasis de la Palmeraie & Kasbahs", 
        "description": "Évadez-vous dans une oasis luxuriante abritant des milliers de palmiers. Découvrez d'anciennes kasbahs cachées dans la verdure et apprenez-en plus sur les systèmes d'irrigation traditionnels.",
        "itinerary": "Excursion d'une journée complète : Votre journée commence par une visite des remparts historiques de Taroudant. Nous nous aventurons ensuite dans une oasis de palmiers voisine, où nous ferons une promenade tranquille pour explorer les canaux d'irrigation traditionnels 'khettara' et visiter une kasbah restaurée pour un thé à la menthe."
      }
    },
    "coverImage": "https://images.pexels.com/photos/3889929/pexels-photo-3889929.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
    "galleryImages": []
  },
  {
    "price": { "amount": 350, "currency": "MAD", "prefix": "from" },
    "locationId": "marrakech",
    "isFeatured": true,
    "translations": {
      "en": { "title": "Evening Souk & Djemaa el-Fna Food Tour", "description": "Immerse yourself in the magic of Marrakech's main square at night. Navigate the bustling souks with a guide and sample a variety of delicious street foods from the famous food stalls." },
      "fr": { "title": "Soirée Souk & Tour Gastronomique à Djemaa el-Fna", "description": "Plongez dans la magie de la place principale de Marrakech la nuit. Naviguez dans les souks animés avec un guide et dégustez une variété de délicieux plats de rue des célèbres stands de nourriture." }
    },
    "coverImage": "https://images.pexels.com/photos/3889742/pexels-photo-3889742.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
    "galleryImages": []
  },
  {
    "price": { "amount": 300, "currency": "MAD", "prefix": "from" },
    "locationId": "agadir",
    "isFeatured": false,
    "translations": {
      "en": { "title": "Visit an Argan Oil Cooperative", "description": "Discover the secret of Morocco's liquid gold. Visit a women-led cooperative to see the traditional process of extracting argan oil, and sample authentic culinary and cosmetic products." },
      "fr": { "title": "Visite d'une Coopérative d'Huile d'Argan", "description": "Découvrez le secret de l'or liquide du Maroc. Visitez une coopérative dirigée par des femmes pour voir le processus traditionnel d'extraction de l'huile d'argan et déguster des produits culinaires et cosmétiques authentiques." }
    },
    "coverImage": "https://images.pexels.com/photos/8696495/pexels-photo-8696495.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
    "galleryImages": []
  },
  {
    "price": { "amount": 750, "currency": "MAD", "prefix": "from" },
    "locationId": "agadir",
    "isFeatured": true,
    "translations": {
      "en": { "title": "Traditional Moroccan Hammam & Massage", "description": "Indulge in a centuries-old wellness ritual. Experience a traditional hammam steam bath and black soap exfoliation, followed by a relaxing argan oil massage to rejuvenate your body and soul." },
      "fr": { "title": "Rituel Hammam Marocain Traditionnel & Massage", "description": "Offrez-vous un rituel de bien-être séculaire. Découvrez un bain de vapeur hammam traditionnel et une exfoliation au savon noir, suivis d'un massage relaxant à l'huile d'argan pour rajeunir votre corps et votre esprit." }
    },
    "coverImage": "https://images.pexels.com/photos/7262995/pexels-photo-7262995.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
    "galleryImages": []
  },
  {
    "price": { "amount": 450, "currency": "MAD", "prefix": "from" },
    "locationId": "tafraout",
    "isFeatured": false,
    "translations": {
      "en": { "title": "Tafraout's Painted Rocks Adventure", "description": "A surreal journey into the Anti-Atlas mountains to witness the famous painted rocks. Explore this unique open-air art installation by Belgian artist Jean Verame set against a stunning granite landscape." },
      "fr": { "title": "Aventure des Rochers Peints de Tafraout", "description": "Un voyage surréaliste dans les montagnes de l'Anti-Atlas pour admirer les célèbres rochers peints. Explorez cette installation artistique unique en plein air de l'artiste belge Jean Verame sur fond d'un paysage de granit époustouflant." }
    },
    "coverImage": "https://images.pexels.com/photos/1590137/pexels-photo-1590137.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
    "galleryImages": []
  },
  {
    "price": { "amount": 250, "currency": "MAD", "prefix": "from" },
    "locationId": "agadir",
    "isFeatured": false,
    "translations": {
      "en": { "title": "Agadir's Bustling Port & Fish Market Tour", "description": "Experience the vibrant, authentic atmosphere of one of Morocco's largest fishing ports. See the daily catch come in, watch the lively fish auction, and enjoy the freshest grilled fish for lunch." },
      "fr": { "title": "Visite du Port Animé & Marché aux Poissons d'Agadir", "description": "Découvrez l'atmosphère vibrante et authentique de l'un des plus grands ports de pêche du Maroc. Observez l'arrivée de la prise du jour, assistez à la criée animée et dégustez le poisson grillé le plus frais pour le déjeuner." }
    },
    "coverImage": "https://images.pexels.com/photos/1633530/pexels-photo-1633530.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
    "galleryImages": []
  },
  {
    "price": { "amount": 1800, "currency": "MAD", "prefix": "from" },
    "locationId": "marrakech",
    "isFeatured": true,
    "translations": {
      "en": { "title": "Majorelle Garden & YSL Museum Visit", "description": "A half-day tour to explore the iconic Jardin Majorelle with its vibrant blue colors, and the sophisticated Yves Saint Laurent Museum dedicated to the legendary fashion designer." },
      "fr": { "title": "Visite du Jardin Majorelle & Musée YSL", "description": "Une demi-journée pour explorer l'emblématique Jardin Majorelle avec ses couleurs bleues vibrantes, et le sophistiqué Musée Yves Saint Laurent dédié au légendaire créateur de mode." }
    },
    "coverImage": "https://images.pexels.com/photos/1603653/pexels-photo-1603653.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2",
    "galleryImages": []
  }
]
